# Создать информационную систему позволяющую работать с учениками школы
# функции:
# 1. Добавление нового студента (Поля - имя, фамилия)
# 2. Добавление предмета (добавляется всем ученикам сразу)
# 3. Добавление оценки ученику по предмету (выбираем ученика(из существующих), выбираем предмет(из сущ.),пишем оценку )
# 4. Показ списка учеников (имена фамилия)
# 5. Показ листа оценок конкретного ученика
# Выход из программы
# Достаточно хранить данные в переменной

import controller

controller.start()